[
 {
    "id" :"1",
    "name" : "The Pursuit of Hobbyness - A web app for finding hobbies.",
    "github" : "https://github.com/chrismacaroline/The-Pursuit-of-Hobbyness",
    "deployed" : "https://chrismacaroline.github.io/The-Pursuit-of-Hobbyness/",
    "image" : "/images/LandingPage.svg",  
     "imageMain" : "/images/POH - main.png",  
    "skill" : "API-JAVASCRIPT-JQUERY",
    "description" : "Discovering new hobbies can feel overwhelming due to unstructured information and unclear starting points. A guided, category-based web application was designed and built using JavaScript and multiple REST APIs to progressively surface relevant hobbies, videos, and reference content with minimal user effort. The experience reduces decision fatigue, provides clear next steps, and enables users to return to previously explored hobbies through persistent client-side storage, resulting in a smoother and more engaging exploration flow.",
    "briefDescription" : "JavaScript web application consuming REST APIs for dynamic content rendering, with client-side persistence implemented using local storage.",
    "titleOne": "Application Landing Page: Start Hobby Exploration Here",
    "subtitleOne": "The page is styled minimally in design and content, with a single prominent call-to-action button.",
    "descriptionOne" : "Clicking the 'FIND NEW HOBBY' button will reveal six categories of hobbies to explore.",
    "imageOne":"/images/LandingPage.svg",
     "titleTwo": "Choose A Hobby Category",
    "subtitleTwo": "The categories are General, Sports and Outdoors, Education, Collection, Competition and Observation. When a category is clicked, a random hobby within that category is suggested.",
    "descriptionTwo" : "Each category is styled as a button and makes an API call when clicked. The REST API in use is: https://api-ninjas.com/api/hobbies",
    "imageTwo":"/images/category 1.svg",
     "titleThree": "Category-Based Hobby Suggestion",
    "subtitleThree": "The application suggests a hobby based on the category chosen in the previous screen. The buttons can restart your exploration from the beginning or from category selection.",
    "descriptionThree" : "If you like the hobby, you can pursue it by clicking the 'PURSUE HOBBY' button.",
    "imageThree":"/images/Suggestion 1.svg",
    "titleFour": "Watch 6 Curated Videos",
    "subtitleFour": "The REST API: YouTube Data API v3 is used to embed videos about the hobby to help get started.",
    "descriptionFour" : "The application filters the API response to display only relevant videos while adhering to copyright and content usage guidelines.",
    "imageFour":"/images/Videos.png",
    "titleSix": "Read About Hobby On Wikipedia",
    "subtitleSix": "Click the 'What is' button to open the Wikipedia page to learn more about the hobby.",
    "descriptionSix" : "The application uses the selected hobby to generate a Wikipedia link, helping users quickly learn more about it.",
    "imageSix":"/images/Wikipedia.mov",
    "titleFive": "View Your Saved Hobbies",
    "subtitleFive": "The application stores the hobbies that you have pursued using the local storage. This is accessed through the 'MY HOBBIES' button on the top right of the screen.",
    "descriptionFive" : "The pursued hobbies are saved under each category for quick retrieval. This also displays the YouTube videos so users can dive right back in.",
    "imageFive":"/images/savedhobbies.png",
    "video": "/images/Screen Recording 2025-12-21 at 22.51.33.mov",
    "videoTitle": "Video Demonstration Of The Application",
    "videoSubtitle": "A walkthrough of the key features of the application, without audio",
    "pagesIntro" : "Screens, Functionality and Core User Experience"
 },
{
  "id" :"cqi",
  "name" : "WebRTC Connection Quality Indicator (Peer to Peer Calls)",
  "image" : "../images/iterationfour.png",
  "description" : "In peer-to-peer calls, the absence of visual feedback around network quality often left users confused by distorted audio or dropped words. A WebRTC connection quality indicator was introduced to surface real-time network status directly within the call interface. By clearly signalling when call issues were network-related, this feature set clearer expectations, reduced user confusion, and improved overall confidence and experience during calls.",
  "briefDescription": "Designed and shipped a real-time connection quality indicator for mesh-based WebRTC calls. Combined WebRTC metrics with a minimal UI to surface network issues early without adding visual noise."
}

]

